[
    {
  "id": 877817,
  "page": 1,
  "results": [
    {
      "author": "Manuel São Bento",
      "author_details": {
        "name": "Manuel São Bento",
        "username": "msbreviews",
        "avatar_path": null,
        "rating": 7
      },
      "content": "FULL SPOILER-FREE REVIEW @ https://movieswetextedabout.com/wolfs-review-george-clooney-brad-pitt-and-endless-entertaining-banter/\r\n\r\n\"Wolfs is one of the most recommendable films of the year. Though it doesn’t reinvent the wheel in the action-comedy genre, it stands out for the undeniable chemistry between George Clooney and Brad Pitt, who elevate a generic yet incredibly entertaining script.\r\n\r\nJon Watts keeps the pacing agile and fun, capitalizing on the never-ending banter between the protagonists to offer moments of sarcastic, ironic enjoyment. Austin Abrams also deserves recognition as a pleasant surprise, perfectly balancing naivety and comedy.\r\n\r\nUltimately, it’s a light, accessible movie for all audiences.\"\r\n\r\nRating: B+",
      "created_at": "2024-09-26T17:36:24.382Z",
      "id": "66f59b981892c1c763d5ceae",
      "updated_at": "2024-09-26T17:36:24.472Z",
      "url": "https://www.themoviedb.org/review/66f59b981892c1c763d5ceae"
    }
  ],
  "total_pages": 1,
  "total_results": 1
},
{
  "id": 1108566,
  "page": 1,
  "results": [
    {
      "author": "Manuel São Bento",
      "author_details": {
        "name": "Manuel São Bento",
        "username": "msbreviews",
        "avatar_path": null,
        "rating": 2
      },
      "content": "FULL SPOILER-FREE REVIEW @ https://movieswetextedabout.com/killer-heat-review-a-forgettable-murder-mystery-bogged-down-by-heavy-exposition-and-over-the-top-twists/\r\n\r\n\"Killer Heat holds a talented cast, but the movie ultimately gets lost in tedious, exposition-driven dialogue, a lack of genuine surprises, and over-the-top twists.\r\n\r\nThe performances are competent but can’t save a formulaic adaptation that also fails to meaningfully explore its prominent theme of jealousy. A bland, easily forgettable murder mystery of just 95 minutes that… feels too long.\r\n\r\nSomething clearly went wrong.\"\r\n\r\nRating: D-",
      "created_at": "2024-09-26T17:27:40.523Z",
      "id": "66f5998c9928bb5109e576e6",
      "updated_at": "2024-09-26T17:27:40.618Z",
      "url": "https://www.themoviedb.org/review/66f5998c9928bb5109e576e6"
    }
  ],
  "total_pages": 1,
  "total_results": 1
},
{
  "id": 1079091,
  "page": 1,
  "results": [
    {
      "author": "Manuel São Bento",
      "author_details": {
        "name": "Manuel São Bento",
        "username": "msbreviews",
        "avatar_path": null,
        "rating": 6
      },
      "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/it-ends-with-us-review-balancing-love-trauma-and-abuse/\r\n\r\n\"It Ends With Us tries to balance heavy drama and conventional romance with some difficulties, but it manages to offer a minimally thought-provoking reflection on generational trauma and relationship abuse.\r\n\r\nFormulaic and not as deep as the complexity of its themes demands, yet still effective enough due to the strong performances of the cast, Justin Baldoni's sensitive lens, and several valuable messages for the audience.\r\n\r\nThe heart is in the right place, despite the problems that haunt the film.\"\r\n\r\nRating: B-",
      "created_at": "2024-08-09T14:12:58.945Z",
      "id": "66b623eab1bb07f22de5d489",
      "updated_at": "2024-08-09T14:13:00.109Z",
      "url": "https://www.themoviedb.org/review/66b623eab1bb07f22de5d489"
    },
    {
      "author": "CinemaSerf",
      "author_details": {
        "name": "CinemaSerf",
        "username": "Geronimo1967",
        "avatar_path": "/yz2HPme8NPLne0mM8tBnZ5ZWJzf.jpg",
        "rating": 6
      },
      "content": "\"Lily\" (Blake Lively) is supposed to give an eulogy at her father's funeral, but she can't. Even with her mother (Amy Morton) there and in the full glare of a packed church, she cannot find five good things to say about the man. Quickly we learn - through some flashbacks - just why that is, and just why she's grown up to be a bit of a romantic. Then she encounters neuro-surgeon \"Ryle\" (Justin Baldoni) and there is instant chemistry. She then opens a long-dreamed of flower shop and a stranger walks in seeking a job. Guess what? She's \"Allysa\" (Jenny Slate) who just happens to be the sister of her enigmatic stranger. Maybe they can make a go of things? Well a dinner one evening brings her face to face with \"Atlas\" (Brandon Sklenar) and that takes us back down the path of retrospection as it turns out that in her younger days, she (Isabela Ferrer) has met this vagrant (Alex Neustaedter) and they's had quite an intense relationship until her father (Kevin McKidd) caught them, and - well you can use your imagination. When \"Ryle\" catches them chatting, he suspects the worst and that proceeds to cause his behaviour to materially change the dynamics as matters take a series of quite unpleasant turns. Now, quite why anyone thought this was a film worth making eluded me. Sure the subject matter is serious, but this plodding drama just takes way too long to get going and then when it might to become more compelling it runs out of steam. The camerawork pays far too much superficial attention to the undercooked character of \"Lily\" and the writing all too often resorts to power-ballad mode when the story becomes potentially more poignant and resonant. We know that the gist of the plot is to underscore not just the effects of domestic violence in the present, but to try and understand the sources so that path need never be taken again, but it's all presented in too shallow a fashion and could easily lose half an hour without impacting on the thrust - such as it is - of the drama. It's disappointing.",
      "created_at": "2024-08-15T08:41:46.434Z",
      "id": "66bdbf4aa03d510e579b7d79",
      "updated_at": "2024-08-15T08:41:46.772Z",
      "url": "https://www.themoviedb.org/review/66bdbf4aa03d510e579b7d79"
    },
    {
      "author": "r96sk",
      "author_details": {
        "name": "",
        "username": "r96sk",
        "avatar_path": "/mwR7rFHoDcobAx1i61I3skzMW3U.jpg",
        "rating": 8
      },
      "content": "I found <em>'It Ends with Us'</em> to be largely great, though the way it ends does make me question how I feel about it.\r\n\r\nThe performances of Blake Lively, Justin Baldoni <em>(just me who thinks he looks a touch like Runar from <em>'Ice Age'</em>? ...)</em>, Brandon Sklenar, Jenny Slate - heck, even Isabela Ferrer and Alex Neustaedter <em>(iffy likeness aside)</em> - are stellar. I sensed a lot of chemistry between Lively & Baldoni and Lively & Sklenar, which is impressive to succeed in that area twice.\r\n\r\nPace-wise the movie jumps along nicely, all the other major elements like editing, music and whatever are all well done and are only plus points. However, the conclusion disappoints a bit. I do think it just about regains its footing to produce a positive ending, though how it gets there by wrapping up the relationship between Lively's Lily and Baldoni's Atlas left me feeling a bit uneasy. As did a few other scenes, though they were of course as intended.\r\n\r\nAmusing that I'm pretty sure I was the only dude (or at least one of a few) in a packed cinema watching this. Upon exiting, visually I kinda felt like Will Smith in that famous <em>'The Pursuit of Happyness'</em> <em>(which I still haven't seen btw, gotta get on that)</em> crowd scene - only surrounded by women. Bit awkward, I can't lie. \"Will watch anything!\" evidently leads me astray sometimes!",
      "created_at": "2024-08-15T22:43:47.916Z",
      "id": "66be84a32b63cbefe2559103",
      "updated_at": "2024-08-15T22:43:48.088Z",
      "url": "https://www.themoviedb.org/review/66be84a32b63cbefe2559103"
    },
    {
      "author": "NikolaiOS",
      "author_details": {
        "name": "",
        "username": "NikolaiOS",
        "avatar_path": "/fWbkmpZ1V6wNBKcwEV0i2JDSyT7.jpg",
        "rating": null
      },
      "content": "Amazing movie, I really like it. It is outstanding.",
      "created_at": "2024-09-25T14:16:27.917Z",
      "id": "66f41b3b740138641e69ff6b",
      "updated_at": "2024-09-25T23:06:44.342Z",
      "url": "https://www.themoviedb.org/review/66f41b3b740138641e69ff6b"
    }
  ],
  "total_pages": 1,
  "total_results": 4
},
{
  "id": 1215162,
  "page": 1,
  "results": [
    {
      "author": "cavemanharris",
      "author_details": {
        "name": "",
        "username": "cavemanharris",
        "avatar_path": null,
        "rating": null
      },
      "content": "Someone really needs to step up and let Jean-Claude Van Damme know that the whole \"killing everyone while he survives\" movie formula just doesn’t work anymore.\r\n\r\nThis movie is almost as bad as Steven Seagal’s—completely impossible and with plotlines that are beyond comprehension.",
      "created_at": "2024-09-24T22:28:29.976Z",
      "id": "66f33d0d17d3253631085037",
      "updated_at": "2024-09-24T22:28:30.029Z",
      "url": "https://www.themoviedb.org/review/66f33d0d17d3253631085037"
    },
    {
      "author": "MovieGuys",
      "author_details": {
        "name": "",
        "username": "MovieGuys",
        "avatar_path": null,
        "rating": 3
      },
      "content": "Jean Claude Van Damme can actually act. I saw him hand in a decent performance in the regrettably short lived, satirical series, Jean-Claude Van Johnson.\r\n\r\nSo given its clear he's not just \"another cookie cutter action star\". Why on earth then, can't they tailor a decent script, for the man? All we seem to get is a regurgitation of past martial arts, action films, from the 20th century, he starred in, only worse again.\r\n\r\nKill Em All 2 a case in question. This is simply a platform for Van Damme's  martial arts skills. Skills that are admittedly impressive, especially given the mans in his 60's. That said, everything else that makes any film work, like a decent script, with a strong back story and characterisations, is mostly absent. \r\n\r\nCome on Hollywood, you can do better than this for Van Damme, surely? \r\n\r\nIn summary, a film that is little more than a showcase for Van Damme's martial arts prowess, minus pretty much everything else that makes a quality action film, well, an action film.",
      "created_at": "2024-09-27T02:14:13.209Z",
      "id": "66f614f5aa7e5fa202964d81",
      "updated_at": "2024-09-27T02:16:25.065Z",
      "url": "https://www.themoviedb.org/review/66f614f5aa7e5fa202964d81"
    }
  ],
  "total_pages": 1,
  "total_results": 2
}
]